_____________________________________________________________________________________________________________________________
Layer (type)                             Output Shape               Param #        Connected to                              
=============================================================================================================================
input_1 (InputLayer)                     (None, 14, 32, 32, 2)      0                                                        
_____________________________________________________________________________________________________________________________
time_distributed_1 (TimeDistributed)     (None, 14, 32, 32, 16)     304            input_1[0][0]                             
_____________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalizatio (None, 14, 32, 32, 16)     64             time_distributed_1[0][0]                  
_____________________________________________________________________________________________________________________________
activation_1 (Activation)                (None, 14, 32, 32, 16)     0              batch_normalization_1[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_2 (TimeDistributed)     (None, 14, 32, 32, 16)     2320           activation_1[0][0]                        
_____________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalizatio (None, 14, 32, 32, 16)     64             time_distributed_2[0][0]                  
_____________________________________________________________________________________________________________________________
activation_2 (Activation)                (None, 14, 32, 32, 16)     0              batch_normalization_2[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_3 (TimeDistributed)     (None, 14, 16, 16, 16)     0              activation_2[0][0]                        
_____________________________________________________________________________________________________________________________
time_distributed_4 (TimeDistributed)     (None, 14, 16, 16, 32)     4640           time_distributed_3[0][0]                  
_____________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalizatio (None, 14, 16, 16, 32)     128            time_distributed_4[0][0]                  
_____________________________________________________________________________________________________________________________
activation_3 (Activation)                (None, 14, 16, 16, 32)     0              batch_normalization_3[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_5 (TimeDistributed)     (None, 14, 8, 8, 32)       0              activation_3[0][0]                        
_____________________________________________________________________________________________________________________________
time_distributed_6 (TimeDistributed)     (None, 14, 8, 8, 64)       18496          time_distributed_5[0][0]                  
_____________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalizatio (None, 14, 8, 8, 64)       256            time_distributed_6[0][0]                  
_____________________________________________________________________________________________________________________________
activation_4 (Activation)                (None, 14, 8, 8, 64)       0              batch_normalization_4[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_7 (TimeDistributed)     (None, 14, 4, 4, 64)       0              activation_4[0][0]                        
_____________________________________________________________________________________________________________________________
bidirectional_1 (Bidirectional)          (None, 14, 4, 4, 256)      1770496        time_distributed_7[0][0]                  
_____________________________________________________________________________________________________________________________
time_distributed_8 (TimeDistributed)     (None, 14, 8, 8, 64)       147520         bidirectional_1[0][0]                     
_____________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalizatio (None, 14, 8, 8, 64)       256            time_distributed_8[0][0]                  
_____________________________________________________________________________________________________________________________
activation_5 (Activation)                (None, 14, 8, 8, 64)       0              batch_normalization_5[0][0]               
_____________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)              (None, 14, 8, 8, 128)      0              activation_5[0][0]                        
                                                                                   activation_4[0][0]                        
_____________________________________________________________________________________________________________________________
time_distributed_9 (TimeDistributed)     (None, 14, 8, 8, 64)       73792          concatenate_1[0][0]                       
_____________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalizatio (None, 14, 8, 8, 64)       256            time_distributed_9[0][0]                  
_____________________________________________________________________________________________________________________________
activation_6 (Activation)                (None, 14, 8, 8, 64)       0              batch_normalization_6[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_10 (TimeDistributed)    (None, 14, 16, 16, 32)     18464          activation_6[0][0]                        
_____________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalizatio (None, 14, 16, 16, 32)     128            time_distributed_10[0][0]                 
_____________________________________________________________________________________________________________________________
activation_7 (Activation)                (None, 14, 16, 16, 32)     0              batch_normalization_7[0][0]               
_____________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)              (None, 14, 16, 16, 64)     0              activation_7[0][0]                        
                                                                                   activation_3[0][0]                        
_____________________________________________________________________________________________________________________________
time_distributed_11 (TimeDistributed)    (None, 14, 16, 16, 32)     18464          concatenate_2[0][0]                       
_____________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalizatio (None, 14, 16, 16, 32)     128            time_distributed_11[0][0]                 
_____________________________________________________________________________________________________________________________
activation_8 (Activation)                (None, 14, 16, 16, 32)     0              batch_normalization_8[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_12 (TimeDistributed)    (None, 14, 32, 32, 16)     4624           activation_8[0][0]                        
_____________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalizatio (None, 14, 32, 32, 16)     64             time_distributed_12[0][0]                 
_____________________________________________________________________________________________________________________________
activation_9 (Activation)                (None, 14, 32, 32, 16)     0              batch_normalization_9[0][0]               
_____________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)              (None, 14, 32, 32, 32)     0              activation_9[0][0]                        
                                                                                   activation_2[0][0]                        
_____________________________________________________________________________________________________________________________
time_distributed_13 (TimeDistributed)    (None, 14, 32, 32, 16)     4624           concatenate_3[0][0]                       
_____________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalizati (None, 14, 32, 32, 16)     64             time_distributed_13[0][0]                 
_____________________________________________________________________________________________________________________________
activation_10 (Activation)               (None, 14, 32, 32, 16)     0              batch_normalization_10[0][0]              
_____________________________________________________________________________________________________________________________
time_distributed_14 (TimeDistributed)    (None, 14, 32, 32, 11)     187            activation_10[0][0]                       
=============================================================================================================================
Total params: 2,065,339
Trainable params: 2,064,635
Non-trainable params: 704
_____________________________________________________________________________________________________________________________
